---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormal
source: html/cc8066a8-cbcb-1a40-265d-a0207a130375.htm
---
# VertexStreamPositionNormal Members

Inserts a VertexStreamPositionNormal into the stream and associated buffer.